fe40/tutorials/rheoEFoam/EEI/PoissonBoltzmann/CrossSlot/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    inlet_top
    {
       type             pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    
    inlet_down
    {
      type              pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    outlet_left
    {
         type           pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    outlet_right
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    
    "(top|base)"
    {
        type            empty;
    }
}

// ************************************************************************* //
