fe40/tutorials/rheoEFoam/EEI/PoissonBoltzmann/CrossSlot/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.5e-04;
 
vertices
(

  (0 0 0)
  (0.9171572875 0 0) //1
  (1.2 0 0)
  (50 0 0) //3
  (50 0.8 0)
  (50 1 0) //5
  (1.2 1 0)
  (1.0585786438 1.0585786438 0) //7
  (1 1.2 0)
  (1 50 0) //9
  (0.8 50 0)
  (0 50 0) //11
  (0 1.2 0)
  (0 0.9171572875 0) //13
  (1.2 0.8 0)
  (0.9171572875 0.9171572875 0) //15
  (1 1 1) // Dummy
  (0.8 1.2 0) //17
  
  (0 0 1.0)
  (0.9171572875 0 1.0) //1
  (1.2 0 1.0)
  (50 0 1.0) //3
  (50 0.8 1.0)
  (50 1 1.0) //5
  (1.2 1 1.0)
  (1.0585786438 1.0585786438 1.0) //7
  (1 1.2 1.0)
  (1 50 1.0) //9
  (0.8 50 1.0)
  (0 50 1.0) //11
  (0 1.2 1.0)
  (0 0.9171572875 1.0) //13
  (1.2 0.8 1.0)
  (0.9171572875 0.9171572875 1.0) //15
  (1 1 1.0) // Dummy
  (0.8 1.2 1.0) //17

);

blocks
(

    hex (0 1 15 13 18 19 33 31) (15 15 1) simpleGrading (0.15 0.15 1) //0    
    hex (1 2 14 15 19 20 32 33) (15 15 1) simpleGrading (1 0.15 1) //1

    hex (2 3 4 14 20 21 22 32) (65 15 1) simpleGrading (400 0.15 1) //2
    hex (14 4 5 6 32 22 23 24) (65 25 1) simpleGrading (400 0.16 1) //3
 
    hex (15 14 6 7 33 32 24 25) (15 25 1) simpleGrading (1 0.16 1) //4
    hex (13 15 17 12 31 33 35 30) (15 15 1) simpleGrading (0.15 1 1) //5
    hex (15 7 8 17 33 25 26 35) (25 15 1) simpleGrading (0.16 1 1) //6
    hex (12 17 10 11 30 35 28 29) (15 65 1) simpleGrading (0.15 400 1) //7
    hex (17 8 9 10 35 26 27 28) (25 65 1) simpleGrading (0.16 400 1) //8
    
);

edges
(

    arc 6 7 (1.1234633135 1.0152240935 0)
    arc 7 8 (1.0152240935 1.1234633135 0) 
    arc 14 15 (1.0469266271 0.830448187 0)
    arc 15 17 (0.830448187 1.0469266271 0) 
    
    arc 24 25 (1.1234633135 1.0152240935 1.0)
    arc 25 26 (1.0152240935 1.1234633135 1.0) 
    arc 32 33 (1.0469266271 0.830448187 1.0)
    arc 33 35 (0.830448187 1.0469266271 1.0) 
    
);

boundary
(
   
    inlet_top
    {
      type patch;
      faces
      (
            (11 10 28 29)
            (10 9 27 28)
            
        );
    }
    
    outlet_right
    {
        type patch;
        faces
        (
            (3 4 22 21)
            (4 5 23 22)
            
        );
    }     
    
    axH
    {
        type patch;
        faces
        (
            (0 1 19 18)
            (1 2 20 19)
            (2 3 21 20)            
        );
    }
    
    axV
    {
        type patch;
        faces
        (
            (0 13 31 18)
            (13 12 30 31)
            (12 11 29 30)            
        );
    }
    
    base
    {
        type empty;
        faces
        (
            (0 1 15 13)
            (13 15 17 12)
            (12 17 10 11)
            (1 2 14 15)
            (2 3 4 14)
            (14 4 5 6)
            (15 14 6 7)
            (15 7 8 17)
            (17 8 9 10)
            
        );
    }
    
    top
    {
        type empty;
        faces
        (
            ( 18 19 33 31 )
            ( 31 33 35 30 )
            ( 30 35 28 29 )
            ( 19 20 32 33 )
            ( 20 21 22 32 )
            ( 32 22 23 24 )
            ( 33 32 24 25 )
            ( 33 25 26 35 )
            ( 35 26 27 28 )
            
        );
    }
    
    walls
    {
        type wall;
        faces
        (
            (5 6 24 23)
            (6 7 25 24)
            (7 8 26 25)
            (8 9 27 26)
        );
    }
    
);

mergePatchPairs
(
);

// ************************************************************************* //
